---
kind: property
id: P:Autodesk.Revit.UI.ComboBoxMemberData.GroupName
source: html/523ad614-a39b-0e85-55ce-87d67387da74.htm
---
# Autodesk.Revit.UI.ComboBoxMemberData.GroupName Property

Gets or sets a group name for the ComboBoxMember.

## Syntax (C#)
```csharp
public string GroupName { get; set; }
```

## Remarks
The GroupName is used to group the items and also appears in the group header.
All ComboBoxMembers assigned to the same group will be grouped in the ComboBox. There will be a header that shows the name.
The default value is Nothing nullptr a null reference ( Nothing in Visual Basic) .